# Renaming columns in a pandas DataFrame

In [4]:
import pandas as pd

In [5]:
url = 'http://bit.ly/uforeports'
ufo = pd.read_csv(url)

In [7]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

# DataFrame.columns

In [10]:
# check out  the columns
# DataFrame.columns will out put a list of columns

In [11]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

# DataFrame.rename()
### Pandas has a built-in function called rename() to change the column names

## Method 1: Renaming a single column by lable

Below are  quick example of how to rename  a column by lable

In [18]:
# df.rename(columns ={'Fee':'Course_Fee'}, inplace=True)
# This changes column from Fee to Courses_Fee
# When inplace=True is passed, the data is renamed in place (it returns nothing)

In [19]:

ufo.rename(columns ={'Colors Reported': 'Colors_Reported', 'Sjape Reported':'Shape_Reported'}, inplace = True)

In [13]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

## Method 2: Renaming multiple columns with List in pandas

In [22]:
ufo_cols =['city','colors reported','shape reported','state','time']

In [23]:
ufo.columns = ufo_cols

In [24]:
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

## Mehod 3: Change columns while reading

In [27]:
url = 'http://bit.ly/uforeports'
ufo = pd.read_csv(url, names=ufo_cols, header=0)

In [28]:
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

## Mehod 4: Replacing spaces with undescores for all columns

In [30]:
ufo.columns = ufo.columns.str.replace(' ','_')

In [31]:
ufo.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00